Autodesk.Revit.DB.FitDirectionType
This enum is used to define the direction to fit the number of pixels defined by PixelSize.
Since:
2011

Autodesk.Revit.DB.FitDirectionType.Vertical
Fit a specific number of pixels in vertical direction.

Autodesk.Revit.DB.FitDirectionType.Horizontal
Fit a specific number of pixels in horizontal direction.